OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1779.c
__at(0x059A) __sfr DAC5CON2;
__at(0x059A) volatile __DAC5CON2bits_t DAC5CON2bits;

__at(0x059A) __sfr DAC5REFH;
__at(0x059A) volatile __DAC5REFHbits_t DAC5REFHbits;

__at(0x059B) __sfr DAC6CON0;
__at(0x059B) volatile __DAC6CON0bits_t DAC6CON0bits;

__at(0x059C) __sfr DAC6CON1;
__at(0x059C) volatile __DAC6CON1bits_t DAC6CON1bits;

__at(0x059C) __sfr DAC6REF;

__at(0x059C) __sfr DAC6REFL;
__at(0x059C) volatile __DAC6REFLbits_t DAC6REFLbits;

__at(0x059D) __sfr DAC6CON2;
__at(0x059D) volatile __DAC6CON2bits_t DAC6CON2bits;

__at(0x059D) __sfr DAC6REFH;
__at(0x059D) volatile __DAC6REFHbits_t DAC6REFHbits;

__at(0x059E) __sfr DAC7CON0;
__at(0x059E) volatile __DAC7CON0bits_t DAC7CON0bits;

__at(0x059F) __sfr DAC7CON1;
__at(0x059F) volatile __DAC7CON1bits_t DAC7CON1bits;

__at(0x059F) __sfr DAC7REF;
__at(0x059F) volatile __DAC7REFbits_t DAC7REFbits;

__at(0x060C) __sfr DAC8CON0;
__at(0x060C) volatile __DAC8CON0bits_t DAC8CON0bits;

__at(0x060D) __sfr DAC8CON1;
__at(0x060D) volatile __DAC8CON1bits_t DAC8CON1bits;

__at(0x060D) __sfr DAC8REF;
__at(0x060D) volatile __DAC8REFbits_t DAC8REFbits;

__at(0x060E) __sfr PRG4RTSS;
__at(0x060E) volatile __PRG4RTSSbits_t PRG4RTSSbits;

__at(0x060F) __sfr PRG4FTSS;
__at(0x060F) volatile __PRG4FTSSbits_t PRG4FTSSbits;

__at(0x0610) __sfr PRG4INS;
__at(0x0610) volatile __PRG4INSbits_t PRG4INSbits;

__at(0x0611) __sfr PRG4CON0;
__at(0x0611) volatile __PRG4CON0bits_t PRG4CON0bits;

__at(0x0612) __sfr PRG4CON1;
__at(0x0612) volatile __PRG4CON1bits_t PRG4CON1bits;

__at(0x0613) __sfr PRG4CON2;
__at(0x0613) volatile __PRG4CON2bits_t PRG4CON2bits;

__at(0x0614) __sfr PWM3DCL;
__at(0x0614) volatile __PWM3DCLbits_t PWM3DCLbits;

__at(0x0615) __sfr PWM3DCH;
__at(0x0615) volatile __PWM3DCHbits_t PWM3DCHbits;

__at(0x0616) __sfr PWM3CON;
__at(0x0616) volatile __PWM3CONbits_t PWM3CONbits;

__at(0x0617) __sfr PWM4DCL;
__at(0x0617) volatile __PWM4DCLbits_t PWM4DCLbits;

__at(0x0618) __sfr PWM4DCH;
__at(0x0618) volatile __PWM4DCHbits_t PWM4DCHbits;

__at(0x0619) __sfr PWM4CON;
__at(0x0619) volatile __PWM4CONbits_t PWM4CONbits;

__at(0x061A) __sfr PWM9DCL;
__at(0x061A) volatile __PWM9DCLbits_t PWM9DCLbits;

__at(0x061B) __sfr PWM9DCH;
__at(0x061B) volatile __PWM9DCHbits_t PWM9DCHbits;

__at(0x061C) __sfr PWM9CON;
__at(0x061C) volatile __PWM9CONbits_t PWM9CONbits;

__at(0x061D) __sfr PWM10DCL;
__at(0x061D) volatile __PWM10DCLbits_t PWM10DCLbits;

__at(0x061E) __sfr PWM10DCH;
__at(0x061E) volatile __PWM10DCHbits_t PWM10DCHbits;

__at(0x061F) __sfr PWM10CON;
__at(0x061F) volatile __PWM10CONbits_t PWM10CONbits;

__at(0x068D) __sfr COG1PHR;
__at(0x068D) volatile __COG1PHRbits_t COG1PHRbits;

__at(0x068E) __sfr COG1PHF;
__at(0x068E) volatile __COG1PHFbits_t COG1PHFbits;

__at(0x068F) __sfr COG1BLKR;
__at(0x068F) volatile __COG1BLKRbits_t COG1BLKRbits;

__at(0x0690) __sfr COG1BLKF;
__at(0x0690) volatile __COG1BLKFbits_t COG1BLKFbits;

__at(0x0691) __sfr COG1DBR;
__at(0x0691) volatile __COG1DBRbits_t COG1DBRbits;

__at(0x0692) __sfr COG1DBF;
__at(0x0692) volatile __COG1DBFbits_t COG1DBFbits;

__at(0x0693) __sfr COG1CON0;
__at(0x0693) volatile __COG1CON0bits_t COG1CON0bits;

__at(0x0694) __sfr COG1CON1;
__at(0x0694) volatile __COG1CON1bits_t COG1CON1bits;

__at(0x0695) __sfr COG1RIS0;
__at(0x0695) volatile __COG1RIS0bits_t COG1RIS0bits;

__at(0x0696) __sfr COG1RIS1;
__at(0x0696) volatile __COG1RIS1bits_t COG1RIS1bits;

__at(0x0697) __sfr COG1RSIM0;
__at(0x0697) volatile __COG1RSIM0bits_t COG1RSIM0bits;

__at(0x0698) __sfr COG1RSIM1;
__at(0x0698) volatile __COG1RSIM1bits_t COG1RSIM1bits;

__at(0x0699) __sfr COG1FIS0;
__at(0x0699) volatile __COG1FIS0bits_t COG1FIS0bits;

__at(0x069A) __sfr COG1FIS1;
__at(0x069A) volatile __COG1FIS1bits_t COG1FIS1bits;

__at(0x069B) __sfr COG1FSIM0;
__at(0x069B) volatile __COG1FSIM0bits_t COG1FSIM0bits;

__at(0x069C) __sfr COG1FSIM1;
__at(0x069C) volatile __COG1FSIM1bits_t COG1FSIM1bits;

__at(0x069D) __sfr COG1ASD0;
__at(0x069D) volatile __COG1ASD0bits_t COG1ASD0bits;

__at(0x069E) __sfr COG1ASD1;
__at(0x069E) volatile __COG1ASD1bits_t COG1ASD1bits;

__at(0x069F) __sfr COG1STR;
__at(0x069F) volatile __COG1STRbits_t COG1STRbits;

__at(0x070D) __sfr COG2PHR;
__at(0x070D) volatile __COG2PHRbits_t COG2PHRbits;

__at(0x070E) __sfr COG2PHF;
__at(0x070E) volatile __COG2PHFbits_t COG2PHFbits;

__at(0x070F) __sfr COG2BLKR;
__at(0x070F) volatile __COG2BLKRbits_t COG2BLKRbits;

__at(0x0710) __sfr COG2BLKF;
__at(0x0710) volatile __COG2BLKFbits_t COG2BLKFbits;

__at(0x0711) __sfr COG2DBR;
__at(0x0711) volatile __COG2DBRbits_t COG2DBRbits;

__at(0x0712) __sfr COG2DBF;
__at(0x0712) volatile __COG2DBFbits_t COG2DBFbits;

__at(0x0713) __sfr COG2CON0;
__at(0x0713) volatile __COG2CON0bits_t COG2CON0bits;

__at(0x0714) __sfr COG2CON1;
__at(0x0714) volatile __COG2CON1bits_t COG2CON1bits;

__at(0x0715) __sfr COG2RIS0;
__at(0x0715) volatile __COG2RIS0bits_t COG2RIS0bits;

__at(0x0716) __sfr COG2RIS1;
__at(0x0716) volatile __COG2RIS1bits_t COG2RIS1bits;

__at(0x0717) __sfr COG2RSIM0;
__at(0x0717) volatile __COG2RSIM0bits_t COG2RSIM0bits;

__at(0x0718) __sfr COG2RSIM1;
__at(0x0718) volatile __COG2RSIM1bits_t COG2RSIM1bits;

__at(0x0719) __sfr COG2FIS0;
__at(0x0719) volatile __COG2FIS0bits_t COG2FIS0bits;

__at(0x071A) __sfr COG2FIS1;
__at(0x071A) volatile __COG2FIS1bits_t COG2FIS1bits;

__at(0x071B) __sfr COG2FSIM0;
__at(0x071B) volatile __COG2FSIM0bits_t COG2FSIM0bits;

__at(0x071C) __sfr COG2FSIM1;
__at(0x071C) volatile __COG2FSIM1bits_t COG2FSIM1bits;

__at(0x071D) __sfr COG2ASD0;
__at(0x071D) volatile __COG2ASD0bits_t COG2ASD0bits;

__at(0x071E) __sfr COG2ASD1;
__at(0x071E) volatile __COG2ASD1bits_t COG2ASD1bits;

__at(0x071F) __sfr COG2STR;
__at(0x071F) volatile __COG2STRbits_t COG2STRbits;

__at(0x078E) __sfr PRG1RTSS;
__at(0x078E) volatile __PRG1RTSSbits_t PRG1RTSSbits;

__at(0x078F) __sfr PRG1FTSS;
__at(0x078F) volatile __PRG1FTSSbits_t PRG1FTSSbits;

__at(0x0790) __sfr PRG1INS;
__at(0x0790) volatile __PRG1INSbits_t PRG1INSbits;

__at(0x0791) __sfr PRG1CON0;
__at(0x0791) volatile __PRG1CON0bits_t PRG1CON0bits;

__at(0x0792) __sfr PRG1CON1;
__at(0x0792) volatile __PRG1CON1bits_t PRG1CON1bits;

__at(0x0793) __sfr PRG1CON2;
__at(0x0793) volatile __PRG1CON2bits_t PRG1CON2bits;

