OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1779.c
__at(0x0794) __sfr PRG2RTSS;
__at(0x0794) volatile __PRG2RTSSbits_t PRG2RTSSbits;

__at(0x0795) __sfr PRG2FTSS;
__at(0x0795) volatile __PRG2FTSSbits_t PRG2FTSSbits;

__at(0x0796) __sfr PRG2INS;
__at(0x0796) volatile __PRG2INSbits_t PRG2INSbits;

__at(0x0797) __sfr PRG2CON0;
__at(0x0797) volatile __PRG2CON0bits_t PRG2CON0bits;

__at(0x0798) __sfr PRG2CON1;
__at(0x0798) volatile __PRG2CON1bits_t PRG2CON1bits;

__at(0x0799) __sfr PRG2CON2;
__at(0x0799) volatile __PRG2CON2bits_t PRG2CON2bits;

__at(0x079A) __sfr PRG3RTSS;
__at(0x079A) volatile __PRG3RTSSbits_t PRG3RTSSbits;

__at(0x079B) __sfr PRG3FTSS;
__at(0x079B) volatile __PRG3FTSSbits_t PRG3FTSSbits;

__at(0x079C) __sfr PRG3INS;
__at(0x079C) volatile __PRG3INSbits_t PRG3INSbits;

__at(0x079D) __sfr PRG3CON0;
__at(0x079D) volatile __PRG3CON0bits_t PRG3CON0bits;

__at(0x079E) __sfr PRG3CON1;
__at(0x079E) volatile __PRG3CON1bits_t PRG3CON1bits;

__at(0x079F) __sfr PRG3CON2;
__at(0x079F) volatile __PRG3CON2bits_t PRG3CON2bits;

__at(0x080D) __sfr COG3PHR;
__at(0x080D) volatile __COG3PHRbits_t COG3PHRbits;

__at(0x080E) __sfr COG3PHF;
__at(0x080E) volatile __COG3PHFbits_t COG3PHFbits;

__at(0x080F) __sfr COG3BLKR;
__at(0x080F) volatile __COG3BLKRbits_t COG3BLKRbits;

__at(0x0810) __sfr COG3BLKF;
__at(0x0810) volatile __COG3BLKFbits_t COG3BLKFbits;

__at(0x0811) __sfr COG3DBR;
__at(0x0811) volatile __COG3DBRbits_t COG3DBRbits;

__at(0x0812) __sfr COG3DBF;
__at(0x0812) volatile __COG3DBFbits_t COG3DBFbits;

__at(0x0813) __sfr COG3CON0;
__at(0x0813) volatile __COG3CON0bits_t COG3CON0bits;

__at(0x0814) __sfr COG3CON1;
__at(0x0814) volatile __COG3CON1bits_t COG3CON1bits;

__at(0x0815) __sfr COG3RIS0;
__at(0x0815) volatile __COG3RIS0bits_t COG3RIS0bits;

__at(0x0816) __sfr COG3RIS1;
__at(0x0816) volatile __COG3RIS1bits_t COG3RIS1bits;

__at(0x0817) __sfr COG3RSIM0;
__at(0x0817) volatile __COG3RSIM0bits_t COG3RSIM0bits;

__at(0x0818) __sfr COG3RSIM1;
__at(0x0818) volatile __COG3RSIM1bits_t COG3RSIM1bits;

__at(0x0819) __sfr COG3FIS0;
__at(0x0819) volatile __COG3FIS0bits_t COG3FIS0bits;

__at(0x081A) __sfr COG3FIS1;
__at(0x081A) volatile __COG3FIS1bits_t COG3FIS1bits;

__at(0x081B) __sfr COG3FSIM0;
__at(0x081B) volatile __COG3FSIM0bits_t COG3FSIM0bits;

__at(0x081C) __sfr COG3FSIM1;
__at(0x081C) volatile __COG3FSIM1bits_t COG3FSIM1bits;

__at(0x081D) __sfr COG3ASD0;
__at(0x081D) volatile __COG3ASD0bits_t COG3ASD0bits;

__at(0x081E) __sfr COG3ASD1;
__at(0x081E) volatile __COG3ASD1bits_t COG3ASD1bits;

__at(0x081F) __sfr COG3STR;
__at(0x081F) volatile __COG3STRbits_t COG3STRbits;

__at(0x088D) __sfr COG4PHR;
__at(0x088D) volatile __COG4PHRbits_t COG4PHRbits;

__at(0x088E) __sfr COG4PHF;
__at(0x088E) volatile __COG4PHFbits_t COG4PHFbits;

__at(0x088F) __sfr COG4BLKR;
__at(0x088F) volatile __COG4BLKRbits_t COG4BLKRbits;

__at(0x0890) __sfr COG4BLKF;
__at(0x0890) volatile __COG4BLKFbits_t COG4BLKFbits;

__at(0x0891) __sfr COG4DBR;
__at(0x0891) volatile __COG4DBRbits_t COG4DBRbits;

__at(0x0892) __sfr COG4DBF;
__at(0x0892) volatile __COG4DBFbits_t COG4DBFbits;

__at(0x0893) __sfr COG4CON0;
__at(0x0893) volatile __COG4CON0bits_t COG4CON0bits;

__at(0x0894) __sfr COG4CON1;
__at(0x0894) volatile __COG4CON1bits_t COG4CON1bits;

__at(0x0895) __sfr COG4RIS0;
__at(0x0895) volatile __COG4RIS0bits_t COG4RIS0bits;

__at(0x0896) __sfr COG4RIS1;
__at(0x0896) volatile __COG4RIS1bits_t COG4RIS1bits;

__at(0x0897) __sfr COG4RSIM0;
__at(0x0897) volatile __COG4RSIM0bits_t COG4RSIM0bits;

__at(0x0898) __sfr COG4RSIM1;
__at(0x0898) volatile __COG4RSIM1bits_t COG4RSIM1bits;

__at(0x0899) __sfr COG4FIS0;
__at(0x0899) volatile __COG4FIS0bits_t COG4FIS0bits;

__at(0x089A) __sfr COG4FIS1;
__at(0x089A) volatile __COG4FIS1bits_t COG4FIS1bits;

__at(0x089B) __sfr COG4FSIM0;
__at(0x089B) volatile __COG4FSIM0bits_t COG4FSIM0bits;

__at(0x089C) __sfr COG4FSIM1;
__at(0x089C) volatile __COG4FSIM1bits_t COG4FSIM1bits;

__at(0x089D) __sfr COG4ASD0;
__at(0x089D) volatile __COG4ASD0bits_t COG4ASD0bits;

__at(0x089E) __sfr COG4ASD1;
__at(0x089E) volatile __COG4ASD1bits_t COG4ASD1bits;

__at(0x089F) __sfr COG4STR;
__at(0x089F) volatile __COG4STRbits_t COG4STRbits;

__at(0x090C) __sfr CM4CON0;
__at(0x090C) volatile __CM4CON0bits_t CM4CON0bits;

__at(0x090D) __sfr CM4CON1;
__at(0x090D) volatile __CM4CON1bits_t CM4CON1bits;

__at(0x090E) __sfr CM4NSEL;
__at(0x090E) volatile __CM4NSELbits_t CM4NSELbits;

__at(0x090F) __sfr CM4PSEL;
__at(0x090F) volatile __CM4PSELbits_t CM4PSELbits;

__at(0x0910) __sfr CM5CON0;
__at(0x0910) volatile __CM5CON0bits_t CM5CON0bits;

__at(0x0911) __sfr CM5CON1;
__at(0x0911) volatile __CM5CON1bits_t CM5CON1bits;

__at(0x0912) __sfr CM5NSEL;
__at(0x0912) volatile __CM5NSELbits_t CM5NSELbits;

__at(0x0913) __sfr CM5PSEL;
__at(0x0913) volatile __CM5PSELbits_t CM5PSELbits;

__at(0x0914) __sfr CM6CON0;
__at(0x0914) volatile __CM6CON0bits_t CM6CON0bits;

__at(0x0915) __sfr CM6CON1;
__at(0x0915) volatile __CM6CON1bits_t CM6CON1bits;

__at(0x0916) __sfr CM6NSEL;
__at(0x0916) volatile __CM6NSELbits_t CM6NSELbits;

__at(0x0917) __sfr CM6PSEL;
__at(0x0917) volatile __CM6PSELbits_t CM6PSELbits;

__at(0x0918) __sfr CM7CON0;
__at(0x0918) volatile __CM7CON0bits_t CM7CON0bits;

__at(0x0919) __sfr CM7CON1;
__at(0x0919) volatile __CM7CON1bits_t CM7CON1bits;

__at(0x091A) __sfr CM7NSEL;
__at(0x091A) volatile __CM7NSELbits_t CM7NSELbits;

__at(0x091B) __sfr CM7PSEL;
__at(0x091B) volatile __CM7PSELbits_t CM7PSELbits;

__at(0x091C) __sfr CM8CON0;
__at(0x091C) volatile __CM8CON0bits_t CM8CON0bits;

__at(0x091D) __sfr CM8CON1;
__at(0x091D) volatile __CM8CON1bits_t CM8CON1bits;

__at(0x091E) __sfr CM8NSEL;
__at(0x091E) volatile __CM8NSELbits_t CM8NSELbits;

__at(0x091F) __sfr CM8PSEL;
__at(0x091F) volatile __CM8PSELbits_t CM8PSELbits;

__at(0x0D1B) __sfr MD4CON0;
__at(0x0D1B) volatile __MD4CON0bits_t MD4CON0bits;

__at(0x0D1C) __sfr MD4CON1;
__at(0x0D1C) volatile __MD4CON1bits_t MD4CON1bits;

__at(0x0D1D) __sfr MD4SRC;
__at(0x0D1D) volatile __MD4SRCbits_t MD4SRCbits;

__at(0x0D1E) __sfr MD4CARL;
__at(0x0D1E) volatile __MD4CARLbits_t MD4CARLbits;

__at(0x0D1F) __sfr MD4CARH;
__at(0x0D1F) volatile __MD4CARHbits_t MD4CARHbits;

__at(0x0D8E) __sfr PWMEN;
__at(0x0D8E) volatile __PWMENbits_t PWMENbits;

__at(0x0D8F) __sfr PWMLD;
__at(0x0D8F) volatile __PWMLDbits_t PWMLDbits;

